7767517
17 17
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=24 1=5 11=5 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1800 9=1
Convolution              convrelu_1               1 1 1 2 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 9=1
Convolution              convrelu_2               1 1 2 3 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=10368 9=1
Convolution              convrelu_3               1 1 3 4 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Pooling                  maxpool2d_11             1 1 4 5 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              convrelu_4               1 1 5 6 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=41472 9=1
Convolution              convrelu_5               1 1 6 7 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Pooling                  maxpool2d_12             1 1 7 8 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Convolution              convrelu_6               1 1 8 9 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592 9=1
Convolution              convrelu_7               1 1 9 10 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Pooling                  maxpool2d_13             1 1 10 11 0=0 1=3 11=3 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_8               1 1 11 12 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=221184 9=1
Convolution              convrelu_9               1 1 12 13 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776 9=1
Pooling                  maxpool2d_14             1 1 13 14 0=0 1=2 11=5 12=1 13=0 2=1 3=1 5=1
Convolution              conv_10                  1 1 14 15 0=23 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4416
Squeeze                  squeeze_25               1 1 15 out0 -23303=1,1
